[
  {
    "displayName": "Marshawn Lynch",
    "roles": "Community Member",
    "comment": "Go bears!",
    "description": "Former NFL running back and Super Bowl champion with the Seattle Seahawks, known for his community activism and outspoken advocacy for social justice."
  },
  {
    "displayName": "Judith Butler",
    "roles": "University Faculty",
    "comment": null,
    "description": "World-renowned philosopher and gender theorist, author of influential works including 'Gender Trouble' and leading scholar on ethics, politics, and social theory."
  },
  {
    "displayName": "Mark LeVine",
    "roles": "UC Irvine professor of History",
    "comment": null,
    "description": "Distinguished professor of Middle Eastern history at UC Irvine, author of multiple books on the region, and prominent public intellectual on Middle East politics."
  },
  {
    "displayName": "Juana María Rodríguez",
    "roles": "UC Berkeley Faculty",
    "comment": "Provost Hermalin—your letter speaks against everything this campus represents—free speech, a commitment to teaching and learning, and our supposed share mission for creating a more just and ethical world.",
    "description": "UC Berkeley Professor of Gender and Women's Studies and Performance Studies, award-winning scholar of queer Latinx studies and sexual politics."
  },
  {
    "displayName": "Sunaura Taylor",
    "roles": "UC Berkeley Faculty",
    "comment": null,
    "description": "UC Berkeley Professor, disability rights activist, artist, and author of 'Beasts of Burden,' exploring connections between disability rights and animal rights."
  },
  {
    "displayName": "Tina Sacks",
    "roles": "UC Berkeley Senate Faculty (Tenure-Track Professor)",
    "comment": null,
    "description": "UC Berkeley Associate Professor in the School of Social Welfare, expert on health inequity, racism, and social policy affecting marginalized communities."
  },
  {
    "displayName": "Adam Benkato",
    "roles": "UC Berkeley Senate Faculty (Tenure-Track Professor)",
    "comment": "UC Berkeley must allow its employees to exercise their free speech rights, to draw attention to genocide, and to uphold justice and solidarity.",
    "description": "UC Berkeley Assistant Professor specializing in African and Middle Eastern studies, linguistics, and the cultural history of the Sahara."
  },
  {
    "displayName": "Naoko Shibusawa",
    "roles": "UC Berkeley Alum, University Faculty",
    "comment": "I am disgusted by the inhumanity of my alma mater's decision to punish Peyrin Kao for his principled stand against genocide. As Olmar El Akkad says, \"One Day, Everyone Will Have Always Been Against This [genocide]. For shame, UC Berkeley. What cowards you are.",
    "description": "Professor of History and American Studies at Brown University, UC Berkeley alumna, and scholar of U.S.-Asia relations and American empire."
  },
  {
    "displayName": "Meg Mills-Novoa",
    "roles": "UC Berkeley Faculty",
    "comment": "The assertion that students' seeing the impact of a hunger strike on Peyrin was a violation of Regents Policy 2301 is a dangerous interpretation of that policy. Furthermore, Peyrin's comments regarding Palestine were made following class. The action against Peyrin seems aimed at limiting free speech and sanctioning a highly visible pro-Palestine voice in campus. Our job as STEM faculty is to encourage our colleagues and students to reckon with the ethical implications of science and technology. I see Peyrin's actions as doing just that.",
    "description": "UC Berkeley Assistant Professor in Environmental Science, Policy and Management, researching water security, climate adaptation, and environmental justice."
  },
  {
    "displayName": "Sohail Daulatzai",
    "roles": "University Faculty",
    "comment": null,
    "description": "Professor and scholar of film and media studies, focusing on race, Islam, popular culture, and resistance movements in the Global South."
  },
  {
    "displayName": "Mary Nolan",
    "roles": "University Faculty",
    "comment": null,
    "description": "Distinguished Professor Emerita of History at New York University, renowned scholar of modern European history, labor, and comparative political economy."
  },
  {
    "displayName": "Jonah Rubin",
    "roles": "University Faculty/Staff, Sr. Manager of Campus Organizing, Jewish Voice for Peace",
    "comment": null,
    "description": "Senior Manager of Campus Organizing at Jewish Voice for Peace, leading grassroots organizing efforts for Palestinian rights and justice on college campuses nationwide."
  },
  {
    "displayName": "Deborah Armintor",
    "roles": "Member of Jewish Vouce for Peace Academic Council",
    "comment": null,
    "description": "Member of the Jewish Voice for Peace Academic Council, advocating for Palestinian human rights and justice within academic communities."
  },
  {
    "displayName": "Michael Ball",
    "roles": "EECS/CS Lecturer, EECS/CS Faculty, UC Berkeley Faculty, UC Alum",
    "comment": null,
    "description": "UC Berkeley Teaching Professor in Computer Science, leader in CS education innovation, and co-creator of influential computing curricula reaching students worldwide."
  },
  {
    "displayName": "Amber Kerr",
    "roles": "UC Berkeley Lecturer",
    "comment": "Berkeley is world-famous for its role in the Free Speech Movement. Its current effort to chill free speech in accordance with the current federal government's priorities is deeply disappointing.  As a Berkeley lecturer myself, and also a PhD alum (ERG 2012), I intend to speak up against this new and unwelcome trend at every step.",
    "description": "UC Berkeley Lecturer with PhD in Energy and Resources, specializing in environmental policy, climate science communication, and sustainability education."
  },
  {
    "displayName": "Brooke Lober",
    "roles": "UC Berkeley Lecturer, UC Berkeley Faculty, UC Alum, Community Member, University Faculty/Staff",
    "comment": null,
    "description": "UC Berkeley Lecturer and alumna, dedicated educator committed to academic freedom and supporting students in critical inquiry and social justice."
  },
  {
    "displayName": "Nathaniel Shrage",
    "roles": "Professor of Animation and Visual Effects at New Mexico State University",
    "comment": null,
    "description": "Professor of Animation and Visual Effects at New Mexico State University, bringing creative and technical expertise to digital media education."
  },
  {
    "displayName": "McKane Andrus",
    "roles": "UC Alum, University Undergrad/Grad Student",
    "comment": "If there was ever a clear line to be drawn for what 'ethical' technology is, it is whether or not the tech supports genocide. In my time at Berkeley (CS + ISF BA, EECS MS), I learned about the IBM punch cards that enabled the holocaust, and it was ok for my professors to say \"never again should our discipline be complicit in something like this.\" This was the absolute bare minimum of our \"tech ethics\" training. The AI and computing technologies being used to surveil Palestinians and mark them for death are most certainly built upon Berkeley innovations in computer vision, databases, etc. At the very least, then, now is the time for us computer scientists to recognize the evil our contributions are being used for and to stand against it. It is damning that the administration would choose to punish and silence the member of CS faculty with the greatest moral clarity around this, and I'm deeply ashamed of my alma mater. (And I'm sure when I visit campus in 30 years I'll be able to drop in on the \"Free Palestine\" Cafe, where there'll be a plaque honoring Peyrin's bravery so the administration can reap the reputational rewards of having always been against genocide once it is again politically convenient.)",
    "description": "UC Berkeley alumnus with degrees in Computer Science and Interdisciplinary Studies, advocate for ethical technology and accountability in AI development."
  },
  {
    "displayName": "KD Thompson",
    "roles": "University Faculty",
    "comment": "The suppression of Palestine advocacy on campuses is a litmus test for the integrity of higher education itself. If we cannot defend the right to oppose genocide without professional retaliation, we have already lost the core values universities claim to uphold.",
    "description": "University faculty member and advocate for academic freedom, speaking out on the importance of protecting free speech and human rights in higher education."
  }
]
