[
  {
    "organization_name": "Jewish Voice for Peace Academic Council",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "Cal YDSA or YDSA at UC Berkeley",
    "description": "Socialist organizing that organizes students, staff, and faculty for a better world",
    "additional_testimony": "We believe in the struggle for a Free Palestine and support Peyrin in his fight against the administration's anti-Palestinian repression and his unjust suspension."
  },
  {
    "organization_name": "American Muslim Voice Foundation",
    "description": "Community and peace building",
    "additional_testimony": ""
  },
  {
    "organization_name": "Berkeley Faculty & Staff for Justice in Palestine",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "Bridge to Humanity (B2H)",
    "description": "B2H is a group of former and current Cisco employees holding Cisco, a priority BDS target, accountable to its own policies for genocide profiteering.",
    "additional_testimony": "Peyrin is the perfect example of how technology should be - ethical and humanity led. Not for profiteering from human rights violations nor for punishing those heroic leaders like Peyrin as UC Berkeley have."
  },
  {
    "organization_name": "Students Organizing for Liberation (SOL)",
    "description": "We are a student led, grassroots democratic organization dedicated to resist the imperialist, zionist, and oppressive projects of UC Berkeley and the UC system.",
    "additional_testimony": "Peyrin Kao’s suspension is a severe escalation from the UC Berkeley administration in trying to silence any word of its complicity in the ongoing genocide in Palestine and its material support in upholding US imperialism. This recent event should alarm all who participate in any shape or form of life on the Berkeley campus, including faculty, staff, campus workers, and especially students. If collective action geared towards Palestinian liberation from these groups is not taken, UC Berkeley, and the UC system at large, will continue to further its efforts in repressing free speech and ensuring that the status quo it has built through exploitation and capitulation is held."
  },
  {
    "organization_name": "Sarah Lawrence Coalition for Palestine",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "CODEPINK Bay Area",
    "description": "Feminist Peace and Justice organization",
    "additional_testimony": "We support and honor Peyrin for his principled commitment to Palestinian liberation."
  },
  {
    "organization_name": "No Tech for Apartheid",
    "description": "Google and Amazon workers organizing against our companies complicity and calling for full divestment",
    "additional_testimony": ""
  },
  {
    "organization_name": "Labor for Palestine National Network",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "UC Berkeley Students for justice in Palestine",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "Philosophy of Computation at Berkeley",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "UC Berkeley Arab Student Union",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "Students for Justice in Palestine at UCSF",
    "description": "",
    "additional_testimony": "We commend Peyrin for their laudable actions and protest of genocide, and maintain our support for them as they face unjust punishment by UC Berkeley."
  },
  {
    "organization_name": "Tech for Liberation",
    "description": "",
    "additional_testimony": "Peyrin Kao stands in a long tradition of Berkeley activism dedicated to justice, human rights, and the liberation of all oppressed peoples - and his willingness to undertake a 38-day hunger strike, in solidarity with Palestinians who are being deliberately starved, shows the depth of his moral commitment.\n\nAll the more disappointing, then, that UC Berkeley has decided to suspend him on dubious premises. The University's attack on his academic freedom is not an isolated incident - it is part of a pattern of repression against free speech at universities across the country. It is a preemptive capitulation to the Trump administration, a cowardly McCarthyist attempt to suppress dissent and sideline the US-backed genocide in Gaza. History will judge harshly. \n\nWe at Stanford admire Peyrin's courage and look to him as a moral exemplar for our own work. As he has noted publicly, Big Tech is deeply complicit in Israel's genocide, and there is much work that we must do to overturn these systems of oppression. We are proud to stand in solidarity with him and wish him all the best.\nReinstate Peyrin Kao, divest from genocide, and free Palestine!"
  },
  {
    "organization_name": "UNCAGE - United Chips Against Global Exploitation",
    "description": "Tech workers",
    "additional_testimony": "Peyrin serves as a moral compass for all of us in STEM, including us tech workers. It’s unconscionable to see him punished for exercising his right to free speech after using his voice to stand up for justice"
  },
  {
    "organization_name": "Undergraduate Street Medicine Outreach",
    "description": "We are a UCB student org committed to bridging the gap between the unhoused and access to basic services in the East Bay.",
    "additional_testimony": ""
  },
  {
    "organization_name": "UCLA Faculty for Justice in Palestine",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "UCLA chapter of UCAFT",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "UC People’s Tribunal for Palestine",
    "description": "The UC People’s Tribunal for Palestine follows on years of escalating protest across all University of California campuses against the unceasing Israeli genocide in occupied Palestine and beyond. We have borne witness as UC leadership failed to condemn genocide or reckon with the implications of its investment, research, and donor complicity in the destruction and devastation of the  Palestinian people. Instead, we have seen UC leaders normalize the Israeli state and defend Zionism while restricting speech and employing militarized police power, exclusion orders, and other modes of repression against students, faculty, and community members for speaking out against the genocide. The erosion of any  semblance of academic freedom and shared governance has not escaped us. We will no longer merely protest leaders who have made clear that they are willing to attack their own community rather than acknowledge their demands for justice. Instead, we have gathered as a people’s tribunal to hold the University of California accountable for complicity in Israel’s genocide of the Palestinian people and the ongoing Nakba  (“catastrophe”).",
    "additional_testimony": ""
  },
  {
    "organization_name": "UC Ethnic Studies Council",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "Muslim Public Affairs Council",
    "description": "",
    "additional_testimony": ""
  },
  {
    "organization_name": "No Azure for Apartheid",
    "description": "Microsoft workers demanding Microsoft cut its cloud and AI contracts with the Israeli military and government.",
    "additional_testimony": ""
  },
  {
    "organization_name": "BUSD Jewish Parents For Collective Liberation",
    "description": "Jewish Parents, students and alumni of Berkeley Unified School District",
    "additional_testimony": ""
  },
  {
    "organization_name": "Berkeley Network for Palestine",
    "description": "Community based organization dedicated to justice for Palestinians and eradicating foreign lobbies from manipulating local politics",
    "additional_testimony": ""
  },
  {
    "organization_name": "Palestinian Youth Movement, Bay Area",
    "description": "",
    "additional_testimony": ""
  }
]