{
  "lastUpdated": "2025-12-11T18:49:50.661113+00:00",
  "totalCount": 20,
  "signatories": [
    {
      "displayName": "Hasan Ibraheem",
      "roles": "Tech Worker",
      "comment": "This is a flagrant violation of free speech and mimics big tech's repression pro-Palestine, the same repression that Peyrin was talking about to begin with. The same tactics that lead to dozens of workers at Google, Amazon, and Microsoft being fired are also being used here because Peyrin dared to speak out for what he believes in.\n\nIt's clear UC Berkeley is specifically coming after pro-Palestine speech. STEM studies are too often depoliticized and sanitized, but the truth is that nothing we study and none of the work we do can be free of politics. We need to be having more of the discussions that Peyrin was starting, not less."
    },
    {
      "displayName": "B. B.",
      "roles": "UC Berkeley Staff",
      "comment": null
    },
    {
      "displayName": "Leela",
      "roles": "UC Berkeley Undergrad Student",
      "comment": "As the letter states, technology is not ethically neutral. I did not set out on my intended career path indifferent to the impact I would make in the world. I imagine many Berkeley students arrived here excited to change people's lives for the better through excellent training... and I believe the university (outwardly) encourages that mindset. Why, then, are we expected not to care about the impact of the institution in which we participate?"
    },
    {
      "displayName": "K. S.",
      "roles": "Community Member",
      "comment": null
    },
    {
      "displayName": "Gianna",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Fiona",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Milagros Galeana",
      "roles": "UC Berkeley Grad Student",
      "comment": "The suspension of this instructor is a direct violation of his right to free speech. There was harm done on any faculty member during his hunger strike and therefore should be no reason to suspend him."
    },
    {
      "displayName": null,
      "roles": "UC Berkeley Undergrad Student, Community Member",
      "comment": null
    },
    {
      "displayName": "Dylan Skolnick",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "S. Y.",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Kathy Le",
      "roles": "University Undergrad/Grad Student",
      "comment": null
    },
    {
      "displayName": null,
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Christa",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Stephen Okita",
      "roles": "Former Peyrin Student, EECS/CS Undergrad Student, UC Berkeley Undergrad Student",
      "comment": "What Provost Benjamin E. Hermalin is a gross violation of civil rights, it is emblematic of the UC Admin's impotency. History will absolve Peyrin, and remember him as a hero. Ben Hermalin will be catalogued as a Judas of all that education and humanity stand for. I would highly encourage him to resign, stand up for something or sit down!"
    },
    {
      "displayName": "Owen Hill",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Brianna",
      "roles": "UC Berkeley Undergrad Student, Community Member",
      "comment": null
    },
    {
      "displayName": "M. M.",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Abigail Brooks-Ramirez",
      "roles": "Worked with Peyrin on Course Staff, EECS/CS Grad Student",
      "comment": "UC Berkeley EECS is one of the largest producers of tech workers, to punish free speech in such a department teaches our students that their education and future work is separable from social contexts, which is inherently untrue. Shame on UC Berkeley and the EECS department for attempting to hide ugly truths from their students and for punishing one of the top lecturers in an already understaffed department."
    },
    {
      "displayName": "Kevin",
      "roles": "Current Peyrin Student (CS 61B / CS 188), Former Peyrin Student, EECS/CS Undergrad Student",
      "comment": null
    },
    {
      "displayName": null,
      "roles": "Former Peyrin Student, UC Berkeley Undergrad Student",
      "comment": null
    }
  ]
}