{
  "lastUpdated": "2025-12-11T19:25:07.326226+00:00",
  "totalCount": 73,
  "signatories": [
    {
      "displayName": "Hasan Ibraheem",
      "roles": "Tech Worker",
      "comment": "This is a flagrant violation of free speech and mimics big tech's repression pro-Palestine, the same repression that Peyrin was talking about to begin with. The same tactics that lead to dozens of workers at Google, Amazon, and Microsoft being fired are also being used here because Peyrin dared to speak out for what he believes in.\n\nIt's clear UC Berkeley is specifically coming after pro-Palestine speech. STEM studies are too often depoliticized and sanitized, but the truth is that nothing we study and none of the work we do can be free of politics. We need to be having more of the discussions that Peyrin was starting, not less."
    },
    {
      "displayName": "B. B.",
      "roles": "UC Berkeley Staff",
      "comment": null
    },
    {
      "displayName": "Leela",
      "roles": "UC Berkeley Undergrad Student",
      "comment": "As the letter states, technology is not ethically neutral. I did not set out on my intended career path indifferent to the impact I would make in the world. I imagine many Berkeley students arrived here excited to change people's lives for the better through excellent training... and I believe the university (outwardly) encourages that mindset. Why, then, are we expected not to care about the impact of the institution in which we participate?"
    },
    {
      "displayName": "K. S.",
      "roles": "Community Member",
      "comment": null
    },
    {
      "displayName": "Gianna",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Fiona",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Milagros Galeana",
      "roles": "UC Berkeley Grad Student",
      "comment": "The suspension of this instructor is a direct violation of his right to free speech. There was harm done on any faculty member during his hunger strike and therefore should be no reason to suspend him."
    },
    {
      "displayName": null,
      "roles": "UC Berkeley Undergrad Student, Community Member",
      "comment": null
    },
    {
      "displayName": "Dylan Skolnick",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "S. Y.",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Kathy Le",
      "roles": "University Undergrad/Grad Student",
      "comment": null
    },
    {
      "displayName": null,
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Christa",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Stephen Okita",
      "roles": "Former Peyrin Student, EECS/CS Undergrad Student, UC Berkeley Undergrad Student",
      "comment": "What Provost Benjamin E. Hermalin is a gross violation of civil rights, it is emblematic of the UC Admin's impotency. History will absolve Peyrin, and remember him as a hero. Ben Hermalin will be catalogued as a Judas of all that education and humanity stand for. I would highly encourage him to resign, stand up for something or sit down!"
    },
    {
      "displayName": "Owen Hill",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Brianna",
      "roles": "UC Berkeley Undergrad Student, Community Member",
      "comment": null
    },
    {
      "displayName": "M. M.",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Abigail Brooks-Ramirez",
      "roles": "Worked with Peyrin on Course Staff, EECS/CS Grad Student",
      "comment": "UC Berkeley EECS is one of the largest producers of tech workers, to punish free speech in such a department teaches our students that their education and future work is separable from social contexts, which is inherently untrue. Shame on UC Berkeley and the EECS department for attempting to hide ugly truths from their students and for punishing one of the top lecturers in an already understaffed department."
    },
    {
      "displayName": "Kevin",
      "roles": "Current Peyrin Student (CS 61B / CS 188), Former Peyrin Student, EECS/CS Undergrad Student",
      "comment": null
    },
    {
      "displayName": null,
      "roles": "Former Peyrin Student, UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": null,
      "roles": "UC Alum",
      "comment": null
    },
    {
      "displayName": "Rithika Ramesh",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "A. W.",
      "roles": "UC Berkeley Grad Student",
      "comment": null
    },
    {
      "displayName": "J. L.",
      "roles": "UC Berkeley Grad Student, UC Alum, Former UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Fernanda Siordia",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Nina",
      "roles": "UC Alum, UCSF grad student",
      "comment": null
    },
    {
      "displayName": "Annabelle",
      "roles": "UC Berkeley Grad Student",
      "comment": null
    },
    {
      "displayName": "Rajoshi Basu",
      "roles": "Former Peyrin Student, EECS/CS Undergrad Student, UC Berkeley Undergrad Student, Community Member, University Undergrad/Grad Student",
      "comment": null
    },
    {
      "displayName": null,
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Erik Nelson",
      "roles": "Former Peyrin Student, Worked with Peyrin on Course Staff",
      "comment": null
    },
    {
      "displayName": "Aliya Ehde",
      "roles": "UC Alum",
      "comment": null
    },
    {
      "displayName": "Gabriela",
      "roles": "UC Berkeley Undergrad Student, Community Member, University Undergrad/Grad Student",
      "comment": null
    },
    {
      "displayName": "Marc Abizeid",
      "roles": "UC Berkeley Staff",
      "comment": null
    },
    {
      "displayName": "Adam",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Jay",
      "roles": "UC Berkeley Grad Student, UC Alum, Former UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Hannah Li",
      "roles": "Former Peyrin Student, UC Alum",
      "comment": null
    },
    {
      "displayName": "Kathleen McLoughlin",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Essie Tuerk-Levy",
      "roles": "University Undergrad/Grad Student",
      "comment": null
    },
    {
      "displayName": "Elliot",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "M. H.",
      "roles": "UC Alum, UC Berkeley Alum, class of 2018",
      "comment": "As an undergraduate student at UC Berkeley, my professors made political statements in class, particularly after the first election of Donald Trump in 2016, and were not punished or retaliated against. This is clearly retaliation for Peyrin’s activism and speech in support of Palestinians and against the genocide in Gaza, and a first amendment violation. It is all the more disappointing coming from a university that claims to pride itself on its role in the free speech movement."
    },
    {
      "displayName": "Cynthia Gómez",
      "roles": "UC Alum",
      "comment": null
    },
    {
      "displayName": "Shayna",
      "roles": "UC Alum, Tech Worker, Peyrin was a UGSI for a class I took in Spring 2020 (CS 161)",
      "comment": "I am a Berkeley EECS alum (Fall 2020) and I currently work in the tech industry. When I think about Berkeley, I think about the way that free speech was touted as an important part of the university's legacy. To throw that legacy - and what makes Berkeley so special - away over ongoing support for a genocide is laughable. \n\nThe EECS major at Berkeley required students to complete an ethics course to graduate because despite the purpotedly \"neutral\" nature of engineering and computer science, nothing about engineering is neutral. The products we make have real-world impact. However, it seems like the EECS department has forgotten its own teachings - when faced with an actual moral dilemma, they have failed spectacularly.\n\nI am in full support of Peyrin and believe he should be reinstated."
    },
    {
      "displayName": "J. I.",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Jeanne Zhu",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Megan",
      "roles": "Former Peyrin Student, UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Mackena Weber",
      "roles": "UC Berkeley Undergrad Student",
      "comment": "Academic freedom for all."
    },
    {
      "displayName": "C. J.",
      "roles": "Community Member",
      "comment": null
    },
    {
      "displayName": "Tamara",
      "roles": "UC Alum, Tech Worker",
      "comment": null
    },
    {
      "displayName": "Denise",
      "roles": "UC Berkeley Undergrad Student, Community Member",
      "comment": null
    },
    {
      "displayName": "Elizabeth Stucki",
      "roles": "Former staff",
      "comment": null
    },
    {
      "displayName": "J. L.",
      "roles": "UC Alum",
      "comment": null
    },
    {
      "displayName": "Oton De Souza",
      "roles": "UC Berkeley Undergrad Student, UC Berkeley Grad Student, UC Alum",
      "comment": "Peyrin spoke up when he saw wrong when the world around him stood silent. And rather than being on the right side of history UC Berkeley continues to suppress speech while claiming itself to be a bastion of freedom of speech. Peyrin chose bravery and humanity, continuing to stand with oppressed people and our community will stand with him."
    },
    {
      "displayName": "Isabel Liu",
      "roles": "Current Peyrin Student (CS 61B / CS 188), UC Berkeley Undergrad Student, University Undergrad/Grad Student",
      "comment": "It’s so important that educators in cs courses speak to the complicity of tech industries in the Palestinian genocide and violence worldwide. It’s disappointing that the university can claim CDSS is an ethics-oriented cs/ds/stats college while simultaneously silencing and punishing educators who attempt to spread awareness on humanitarian crises happening right now, that students in said college are participating in as they enter the industry as interns for complicit companies. I was a Public Health student first, then decided to double major in Data Science, and it shocked me that fellow CS/DS majors told me they “don’t believe in the genocide”, “don’t believe protest works”, or are interning at Raytheon or something with no consideration to the implications of their career. Does that not alarm the university which goes on to have so many cs/ds students in important positions in the world? Peyrin is a great teacher and example. I took CS61B when he wasn’t teaching and dropped the class, took it again this semester and he helped a lot. I’m sure the university will look back in 50 years and preach the power and importance of students and staff who spoke up against genocide, reaping the benefits of a “progressive” and “free speech” university, but for now prefer to keep their hands bloody for the sake of money. I chose this university for its supposed values and I’m ashamed to be made a fool."
    },
    {
      "displayName": "Meg Mills-Novoa",
      "roles": "UC Berkeley Faculty",
      "comment": "The assertion that students’ seeing the impact of a hunger strike on Peyrin was a violation of Regents Policy 2301 is a dangerous interpretation of that policy. Furthermore, Peyrin’s comments regarding Palestine were made following class. The action against Peyrin seems aimed at limiting free speech and sanctioning a highly visible pro-Palestine voice in campus. Our job as STEM faculty is to encourage our colleagues and students to reckon with the ethical implications of science and technology. I see Peyrin’s actions as doing just that."
    },
    {
      "displayName": "Julianne Tenorio",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Wil Mullen",
      "roles": "Tech Worker",
      "comment": null
    },
    {
      "displayName": "Charlotte Taylor",
      "roles": "UC Berkeley Staff",
      "comment": null
    },
    {
      "displayName": "J. C.",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "H. T.",
      "roles": "UC Alum",
      "comment": null
    },
    {
      "displayName": "Andrew",
      "roles": "UC Alum, Tech Worker",
      "comment": "UC Berkeley should be ashamed of its treatment of Peyrin. Cal claims to have 7 principles of community, yet the university’s treatment clearly illustrates how it fails to take them seriously, especially Free Speech, Honesty/Integrity, Just Community, and Civility/Respect. Until the university reinstates Peyrin, it will be an embarrassment to claim UC Berkeley as my alma mater."
    },
    {
      "displayName": "Henry",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Sakina",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": null,
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Nicole",
      "roles": "UC Berkeley Staff",
      "comment": "Peyrin’s voice should be amplified, not silenced. By putting him on unpaid leave, the university is showing how complicit they are in the genocide. Free speech, and free Palestine"
    },
    {
      "displayName": "Aarynn Harris",
      "roles": "Community Member",
      "comment": "UC Berkeley please do better and stop demonizing your fellow staff/students for standing up for what’s right and using his voice for good. Don’t wear your “activism” as a badge of honor only when it benefits you, stick to the truth and speak proudly against ALL injustices. Also your CS department will go to hell without Peyrin let’s be real."
    },
    {
      "displayName": "Morgan",
      "roles": "UC Alum",
      "comment": null
    },
    {
      "displayName": "M. S.",
      "roles": "Current Peyrin Student (CS 61B / CS 188), Former Peyrin Student, EECS/CS Undergrad Student, UC Berkeley Undergrad Student, University Undergrad/Grad Student",
      "comment": "My first class with Peyrin was CS61B during the Fall of 2023. Throughout that class, he\nwas nothing but professional. He explained concepts in ways that were easy to\nunderstand and had a very big impact on me in furthering my pursuit of CS. When the\nOctober 7th attacks occurred, as a Jewish student, Peyrin’s class was the class I felt the\nmost heard and the safest in.\n\nSince CS61B I have taken two other classes from Peyrin and he has been nothing but\nan excellent instructor. It is shameful that the university has decided to suspend him\nwhen he is one of the best instructors in the department and has kept his classroom a\nsafe and productive environment for all students."
    },
    {
      "displayName": "Rawan",
      "roles": "UC Alum, Tech Worker",
      "comment": "Peyrin’s suspension is a disturbing infringement on ethical standards and free speech. By disregarding the complicity and active role of tech and US institutions in an ongoing genocide, UC Berkeley risks eroding its standing as a university grounded in critical inquiry, moral clarity, and academic integrity. This is a profound moral failure and I am deeply disappointed in my Alma Mater, I sincerely hope that UC Berkeley makes the correct decision to reinstate Peyrin and issue a full apology to him and the student body."
    },
    {
      "displayName": "E. S.",
      "roles": "UC Berkeley Undergrad Student",
      "comment": null
    },
    {
      "displayName": "Janice",
      "roles": "Former Peyrin Student, EECS/CS Undergrad Student, UC Berkeley Undergrad Student, University Undergrad/Grad Student, Tech Worker",
      "comment": "I am extremely grateful to Peyrin for using his voice to make minority students feel heard\nand safe. As we rarely hear professors from our departments speak to us about the\nvalue behind our work, Peyrin has been so valuable to shaping our education and\nmaking us feel heard on campus."
    },
    {
      "displayName": "Shadrick Small",
      "roles": "UC Berkeley Staff, UC Alum",
      "comment": null
    },
    {
      "displayName": "Sarika Pasumarthy",
      "roles": "Former Peyrin Student, EECS/CS Undergrad Student, EECS/CS Faculty, UC Berkeley Undergrad Student, UC Berkeley Staff, University Undergrad/Grad Student",
      "comment": null
    },
    {
      "displayName": "Davis",
      "roles": "UC Berkeley Grad Student",
      "comment": null
    }
  ]
}